---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DirectContext3DHandleOverrides Properties
DirectContext3DHandleOverrides Class See Also Send Feedback
---

The DirectContext3DHandleOverrides type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DirectContext3DHandleOverrides Class

Autodesk.Revit.DB.DirectContext3D Namespace